/** @type {import('next').NextConfig} */
const nextConfig = {
  images: {
    domains: ["images.pexels.com"],
  },
};

module.exports = nextConfig;




// Тайлбар:

// Код нь Next.js-ийн тохиргооны тохиргоог агуулсан nextConfig хэмээх тогтмолыг тодорхойлж эхэлдэг.
// NextConfig доторх зургуудын шинж чанар нь аппликешнд зураг хэрхэн ажиллахыг тохируулахад ашиглагддаг.
// Зургийн доорх домэйн шинж чанар нь зураг татах боломжтой домэйнүүдийг тодорхойлсон массив юм.
// Энэ тохиолдолд код нь "images.pexels.com"-оос зураг татахыг зөвшөөрдөг.Дараа нь nextConfig объектыг програмын бусад хэсгүүдэд ашиглахын тулд экспортлодог.